# GetReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePlane..::..GetReference Method
ReferencePlane Class See Also
---
Returns the geometry reference of the reference plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Reference GetReference()
```

Visual Basic
---
```text
Public Function GetReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetReference()
```

# ### Return Value
The geometry reference of the reference plane.
# See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace